backend/controllers/GoodsController.php

INSERT INTO `goods` (`goods_id`, `goods_name`, `goods_price`, `goods_detail`, `goods_status`, `goods_image`) VALUES (NULL, '', NULL, '', NULL, '2016-06-12 13-00-19屏幕截图.png')
---
    public function actionCreate()
    {
        $model = new Goods();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `goods` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Goods::findOne($id)) !== null) {