frontend/controllers/GoodsController.php

    public function actionList(){
        $goods = new Goods();
        $data = $goods->find()->asArray()->all();
---
SELECT * FROM `goods`